Revit 2026 API

# PaperSource Class

---

An object that represents a Paper Source of Print Setup within the Autodesk Revit project.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBPaperSource

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PaperSource : APIObject
```
```vb
Public Class PaperSource
	Inherits APIObject
```
```cpp
public ref class PaperSource : public APIObject
```
```fsharp
type PaperSource =
    class
        inherit APIObject
    end
```

The PaperSource type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | Name | Retrieve the paper source name of current project. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This object derived from the APIObject base object.

#### Reference

Autodesk.Revit.DB Namespace